{
  "auditTitle": "Apple Developer Token & JWT",
  "auditDate": "2026-02-14T10:16:05Z",
  "filesExamined": 13,
  "totalFindings": 12,
  "summary": {
    "critical": 0,
    "high": 3,
    "medium": 7,
    "low": 2
  },
  "findings": [
    {
      "severity": "HIGH",
      "number": 1,
      "title": "Developer Token response lacks explicit anti-caching headers (token may be cached/shared)",
      "file": "apps/web/src/app/api/apple/dev-token/route.ts",
      "lines": "5-15",
      "category": "will-break",
      "description": "The Developer Token endpoint returns a bearer credential but does not set any explicit response caching directives (e.g. `Cache-Control: no-store`) and does not set `Vary: Origin`. In environments with intermediate caches (CDN/proxy) or client-side caching behaviors, this increases the risk that a signed Developer Token is cached longer than intended and/or served across request contexts.\n\nThis is amplified by the fact that the route relies on `corsHeaders(request)` which only sets `Content-Type` and conditionally `Access-Control-Allow-Origin`, with no cache-related headers.",
      "code": "export async function GET(request: NextRequest) {\n  const result = await handleDevToken();\n  const status = \"error\" in result ? 503 : 200;\n  return new Response(JSON.stringify(result), {\n    status,\n    headers: corsHeaders(request),\n  });\n}",
      "whyThisMatters": "A Developer Token is a credential. Accidental caching (especially shared caching) can widen token exposure and make abuse easier."
    },
    {
      "severity": "HIGH",
      "number": 2,
      "title": "“Localhost” CORS detection is overly permissive (accepts non-local origins like `http://localhost.evil.com`)",
      "file": "apps/web/src/lib/cors.ts",
      "lines": "7-16",
      "category": "will-break",
      "description": "When `ALLOWED_ORIGIN` is unset, `getAllowOrigin()` treats any `Origin` header that *starts with* `http://localhost` or `http://127.0.0.1` as “local”. This matches attacker-controlled domains such as `http://localhost.evil.com` (a valid origin string) and will echo that origin back as allowed.\n\nThe comment claims “only localhost/127.0.0.1 are allowed”, but the actual predicate is prefix-based and therefore broader than intended.",
      "code": "const isLocalOrigin =\n  origin &&\n  (origin.startsWith(\"http://localhost\") || origin.startsWith(\"http://127.0.0.1\"));\n...\nreturn isLocalOrigin ? origin : null;",
      "whyThisMatters": "If `ALLOWED_ORIGIN` is missing in a deployed environment (or during development), a hostile webpage on a `localhost*.tld` origin can read the Developer Token response via browser JavaScript, increasing token leakage risk."
    },
    {
      "severity": "HIGH",
      "number": 3,
      "title": "Dev-token endpoint is unauthenticated and not rate-limited; CORS does not prevent non-browser extraction/abuse",
      "file": "docs/tech/apple-music.md",
      "lines": "34-38",
      "category": "will-break",
      "description": "The documentation explicitly states rate limiting is not implemented for the dev-token endpoint. The implementation also does not include any authentication, abuse controls, or rate limiting in the route handler path. CORS only influences whether browsers expose the response to JavaScript; it does not prevent direct HTTP clients (server-side scripts, bots) from calling the endpoint and receiving tokens.",
      "code": "- Developer Token must be generated server-side only. Restrict dev-token endpoint by origin and optionally rate-limit.\n- **Rate limiting:** Not implemented for the dev-token endpoint yet. Consider adding per-IP or per-origin limits ...",
      "whyThisMatters": "A publicly callable “mint token on demand” endpoint can be abused for token harvesting and downstream Apple API quota/rate consumption, and CORS alone does not meaningfully constrain non-browser callers."
    },
    {
      "severity": "MEDIUM",
      "number": 4,
      "title": "`ALLOWED_ORIGIN` supports comma-separated values but silently uses only the first origin",
      "file": "apps/web/src/lib/cors.ts",
      "lines": "12-15",
      "category": "will-break",
      "description": "When `ALLOWED_ORIGIN` is set, the code splits on commas and uses only the first entry. This can be surprising for operators who expect multiple origins to work (staging + prod, multiple frontends). It also creates a misconfiguration footgun: the first origin in the list becomes the only one ever emitted.",
      "code": "if (configured) {\n  const single = configured.split(\",\")[0].trim();\n  return single || (isLocalOrigin ? origin : null);\n}",
      "whyThisMatters": "Misconfigured CORS often presents as “token endpoint broken” in production, and can lead to ad-hoc relaxations elsewhere or accidental exposure during troubleshooting."
    },
    {
      "severity": "MEDIUM",
      "number": 5,
      "title": "Preflight responses are incomplete (no `Access-Control-Allow-Methods` / `Access-Control-Allow-Headers` / `Vary`)",
      "file": "apps/web/src/app/api/apple/dev-token/route.ts",
      "lines": "5-7",
      "category": "will-break",
      "description": "The `OPTIONS` handler returns `204` with `corsHeaders(request)`, which only sets `Content-Type` and maybe `Access-Control-Allow-Origin`. It does not return common preflight headers (`Access-Control-Allow-Methods`, `Access-Control-Allow-Headers`, `Access-Control-Max-Age`). While the current client path uses a simple `GET`, this is fragile and can break if the request becomes non-simple (custom headers, credentials mode changes, or future method changes).",
      "code": "export async function OPTIONS(request: NextRequest) {\n  return new Response(null, { status: 204, headers: corsHeaders(request) });\n}",
      "whyThisMatters": "CORS failures can be intermittent and environment-specific, and are expensive to debug; the current implementation is minimal and easy to outgrow."
    },
    {
      "severity": "MEDIUM",
      "number": 6,
      "title": "Signing failures are swallowed with no logging; error text implies logs exist",
      "file": "apps/api/src/routes/apple/dev-token.ts",
      "lines": "20-32",
      "category": "slop",
      "description": "`handleDevToken()` catches all errors during signing and returns a generic error message, but does not log the underlying exception. The returned message instructs operators to “Check server configuration and logs,” but this function itself does not emit any logs, so failures can become opaque unless the hosting platform logs unhandled errors elsewhere (these are handled here).",
      "code": "try {\n  const token = await signDeveloperToken({ teamId, keyId, privateKeyPem: privateKey });\n  ...\n  return { token };\n} catch {\n  return { error: \"Token signing failed. Check server configuration and logs.\" };\n}",
      "whyThisMatters": "Operational diagnosability is reduced: invalid PEM formatting, wrong key type, or runtime crypto issues all collapse to the same message with no local trace."
    },
    {
      "severity": "MEDIUM",
      "number": 7,
      "title": "PEM normalization does not handle some common env encodings (e.g. literal `\\\\r\\\\n`), leading to hard-to-diagnose failures",
      "file": "apps/api/src/lib/jwt.ts",
      "lines": "22-30",
      "category": "will-break",
      "description": "Normalization replaces literal `\\\\n` sequences and real `\\r\\n` / `\\r`. If an environment value uses Windows newlines encoded as literal `\\\\r\\\\n`, the `\\\\n` portion becomes a real newline but the `\\\\r` remains as a literal backslash + `r` character, which can corrupt the PEM and cause `createPrivateKey()` to throw.\n\nThere is also no explicit validation that the PEM contains the expected header/footer; malformed-but-non-empty values proceed to crypto parsing and then fail inside signing.",
      "code": "const normalizedPem = privateKeyPem\n  .replace(/\\\\n/g, \"\\n\")\n  .replace(/\\r\\n/g, \"\\n\")\n  .replace(/\\r/g, \"\\n\");\nconst keyObject = createPrivateKey({ key: normalizedPem, format: \"pem\" });",
      "whyThisMatters": "A small configuration formatting difference can fully break token issuance, and the current error handling path makes root-cause identification difficult."
    },
    {
      "severity": "LOW",
      "number": 8,
      "title": "Redundant/unreachable check for `token` after signing",
      "file": "apps/api/src/routes/apple/dev-token.ts",
      "lines": "26-28",
      "category": "slop",
      "description": "After `await signDeveloperToken(...)`, the code checks `if (!token)` and returns an error. In practice, `signDeveloperToken()` either resolves to a non-empty string or throws; returning an empty string is not a meaningful expected state.",
      "code": "if (!token) {\n  return { error: \"Failed to sign developer token\" };\n}",
      "whyThisMatters": "Minor, but it adds dead-path logic and makes it harder to reason about actual failure modes (throw vs. empty result)."
    },
    {
      "severity": "MEDIUM",
      "number": 9,
      "title": "Client token cache TTL is hard-coded and not derived from the JWT `exp` claim",
      "file": "apps/web/src/lib/musickit.ts",
      "lines": "43-70",
      "category": "will-break",
      "description": "The client caches the Developer Token for a fixed 55 minutes, assuming the server token is valid for 1 hour. The cache does not parse the JWT `exp` claim. If the server’s token validity changes (shorter or longer), the client behavior can drift: it may continue using a token that is already expired, or it may refresh more often than necessary.",
      "code": "const TOKEN_CACHE_TTL_MS = 55 * 60 * 1000; // 55 minutes\n...\ncachedToken = data.token;\ntokenExpiresAt = Date.now() + TOKEN_CACHE_TTL_MS;",
      "whyThisMatters": "Token validity mismatches manifest as sporadic MusicKit failures after an app has been open for some time, which is a poor UX and hard to diagnose."
    },
    {
      "severity": "MEDIUM",
      "number": 10,
      "title": "Client token fetch uses default fetch caching semantics; combined with server headers, token responses may be stored in HTTP caches",
      "file": "apps/web/src/lib/musickit.ts",
      "lines": "52-58",
      "category": "will-break",
      "description": "`fetchDeveloperToken()` uses `fetch(devTokenUrl())` with default options. If the dev-token response is cacheable (explicitly or implicitly via intermediaries), the token can be persisted in browser/proxy caches outside the in-memory TTL model, potentially longer than intended.",
      "code": "cachedToken = null;\ntokenExpiresAt = 0;\nconst res = await fetch(devTokenUrl());",
      "whyThisMatters": "Even if the app intends to keep the token ephemeral (memory-only), HTTP caching layers can undermine that assumption."
    },
    {
      "severity": "MEDIUM",
      "number": 11,
      "title": "Test suite references a private key fixture file in-repo (private key material present in repository)",
      "file": "apps/api/tests/dev-token.test.ts",
      "lines": "6-9, 35-39",
      "category": "will-break",
      "description": "The tests rely on a PEM private key fixture at `tests/fixtures/apple-test-key.pem`. Even if this key is intended purely for testing, it is still private key material stored in the repo, which increases the risk of accidental reuse, security scanning alerts, and policy violations (“no secrets”) depending on organizational standards.",
      "code": "const FIXTURE_KEY_PATH = join(process.cwd(), \"tests/fixtures/apple-test-key.pem\");\n...\nprocess.env.APPLE_PRIVATE_KEY = readFileSync(FIXTURE_KEY_PATH, \"utf8\");",
      "whyThisMatters": "Private key material in-repo tends to spread (copied into other contexts) and can be mistakenly treated as acceptable precedent for handling real signing keys."
    },
    {
      "severity": "LOW",
      "number": 12,
      "title": "Documentation mismatches can mislead operators about CORS behavior and current implementation state",
      "file": "docs/exec-plans/completed/002-api-dev-token.md",
      "lines": "10-13",
      "category": "slop",
      "description": "The completed plan states that in dev the route allows request origin when “localhost/https,” but the current code only matches `http://localhost` / `http://127.0.0.1` (no `https://localhost`), and the localhost matching is prefix-based (broader than “localhost only”). The same doc also highlights rate limiting as not implemented, which remains true and is security-relevant, but may be interpreted as “documented therefore acceptable.”",
      "code": "- **T009** – CORS on dev-token route: `Access-Control-Allow-Origin` from `ALLOWED_ORIGIN` or, in dev, request origin when localhost/https.\n- **T012** – ... Fixture key in `tests/fixtures/apple-test-key.pem`.",
      "whyThisMatters": "Stale or imprecise docs drive configuration mistakes and can create a false sense of security about origin restrictions."
    }
  ],
  "auditId": "02-apple-token",
  "sourceFile": "02-apple-token.md"
}